### <center> Лекционный материал

In [30]:
import psycopg2
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

In [32]:
connection = psycopg2.connect(
   dbname = DBNAME,
   user = USER,
   host = HOST,
   password = PASSWORD,
   port = PORT
)

In [33]:
n = 10
query = f'''select *
           from sql.pokemon
           limit {n}
        '''

In [34]:
df = pd.read_sql_query(query, connection)
display(df)

   id                       name  type1   type2  hp  attack  defense  speed
0   1                  Bulbasaur  Grass  Poison  45      49       49     45
1   2                    Ivysaur  Grass  Poison  60      62       63     60
2   3                   Venusaur  Grass  Poison  80      82       83     80
3   4      VenusaurMega Venusaur  Grass  Poison  80     100      123     80
4   7                  Charizard   Fire  Flying  78      84       78    100
5   8  CharizardMega Charizard X   Fire  Dragon  78     130      111    100
6   9  CharizardMega Charizard Y   Fire  Flying  78     104       78    100
7  16                 Butterfree    Bug  Flying  60      45       50     70
8  17                     Weedle    Bug  Poison  40      35       30     50
9  18                     Kakuna    Bug  Poison  45      25       50     35

In [35]:
connection.close()

### <center> Решение задач

In [36]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [37]:
connection = psycopg2.connect(
    dbname = DBNAME,
    user = USER,
    host = HOST,
    password = PASSWORD,
    port = PORT
)

In [38]:
query_3_1 = f'''
        SELECT
            COUNT(id) AS "count"
        
        FROM
            VACANCIES
'''

df = pd.read_sql_query(query_3_1, connection)
display(df)

   count
0  49197

In [39]:
query_3_2 = f'''
        SELECT
            COUNT(id) AS count
        
        FROM
            EMPLOYERS
'''

df = pd.read_sql_query(query_3_2, connection)
display(df)

   count
0  23501

In [40]:
query_3_3 = f'''
        SELECT
            COUNT(id) AS count

        FROM
            AREAS
'''

df = pd.read_sql_query(query_3_3, connection)
display(df)

   count
0   1362

In [41]:
query_3_4 = f'''
        SELECT
            COUNT(id) AS count

        FROM
            INDUSTRIES
'''

df = pd.read_sql_query(query_3_4, connection)
display(df)

   count
0    294

In [42]:
query_4_1 = f'''
        SELECT
            COUNT(v.id) AS cnt,
            a.name AS area

        FROM
            VACANCIES as v
        LEFT JOIN
            AREAS AS a ON v.area_id = a.id

        GROUP BY
            a.name

        ORDER BY
            COUNT(v.id) DESC

        LIMIT
            5
'''

df = pd.read_sql_query(query_4_1, connection)
display(df)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

In [43]:
query_4_2 = f'''
        SELECT
            COUNT(id)
        
        FROM
            VACANCIES
        
        WHERE
            salary_from IS NOT NULL OR salary_to IS NOT NULL
'''

df = pd.read_sql_query(query_4_2, connection)
display(df)

   count
0  24073

In [44]:
query_4_3 = f'''
        SELECT
            INT4(AVG(salary_from)) AS avg_salary_from,
            INT4(AVG(salary_to)) AS avg_salary_to

        FROM
            VACANCIES        
'''

df = pd.read_sql_query(query_4_3, connection)
df

   avg_salary_from  avg_salary_to
0            71065         110537

In [45]:
query_4_4 = f'''
        SELECT
            COUNT(id),
            schedule,
            employment

        FROM
            VACANCIES
        
        GROUP BY
            schedule, employment

        ORDER BY
            COUNT(id) DESC

        LIMIT
            3
'''

df = pd.read_sql_query(query_4_4, connection)
display(df)

   count          schedule        employment
0  35367       Полный день  Полная занятость
1   7802  Удаленная работа  Полная занятость
2   1593     Гибкий график  Полная занятость

In [46]:
query_4_5 = f'''
        SELECT
            COUNT(id),
            experience
        
        FROM
            VACANCIES
        
        GROUP BY
            experience

        ORDER BY
            COUNT(id)
'''

df = pd.read_sql_query(query_4_5, connection)
display(df)

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

In [47]:
query_5_1 = f'''
        SELECT
            e.name,
            COUNT(v.id)

        FROM
            VACANCIES AS v
        LEFT JOIN
            EMPLOYERS AS e ON v.employer_id = e.id

        GROUP BY
            e.name
        
        ORDER BY
            COUNT(v.id) DESC

        LIMIT 
            5
'''

df = pd.read_sql_query(query_5_1, connection)
display(df)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [55]:
query_5_2 = f'''
        SELECT
            a.name,
            COUNT(DISTINCT e.id)

        FROM
            AREAS AS a
        LEFT JOIN
            EMPLOYERS AS e ON a.id = e.area

        GROUP BY
            a.name

        ORDER BY
            COUNT(DISTINCT e.id) DESC
'''

df = pd.read_sql_query(query_5_2, connection)
display(df)

                 name  count
0              Москва   5864
1     Санкт-Петербург   2217
2               Минск   1115
3              Алматы    721
4        Екатеринбург    609
...               ...    ...
1357            Урень      0
1358           Уруссу      0
1359         Урюпинск      0
1360           Усмань      0
1361      Усть-Абакан      0

[1362 rows x 2 columns]